
Модуль № 1

Настройка ISP
root / toor
hostnamectl hostname isp; exec bash

cd /etc/net/ifaces/ cp -r ens18/ ens19 cd ens19
vim options

BOOTPROTO=static TYPE=eth DISABLED=no ONBOOT=yes
esc -> shift+z+z
cd ens19
echo "172.16.4.1/28" >> ipv4address cd ..
cp -r ens19/ ens20
echo "172.16.5.1/28" > ens20/ipv4address systemctl restart network
ip -c -br a
vim /etc/net/sysctl.conf
В файле /etc/net/sysctl.conf изменяем строку 0 на 1:
net.ipv4.ip_forward = 1
esc -> shift+z+z
В терминал вписать команду: sysctl -w net.ipv4.ip_forward=1
Добавляем правила iptales на ISP: apt-get update && apt-get install -y iptables
iptables -A POSTROUTING -t nat -s 172.16.4.0/28 -o ens18 -j MASQUERADE iptables -A POSTROUTING -t nat -s 172.16.5.0/28 -o ens18 -j MASQUERADE iptables -t nat –L
iptables-save > /etc/sysconfig/iptables systemctl enable --now iptables.service
 
Настройка статического IP адреса на HQ-SRV root / toor
hostnamectl hostname hq-srv.au-team.irpo; exec bash

[root@noname ~]# cd /etc/net/ifaces/ [root@noname ifaces]# cd ens18 [root@noname ens18]# vim options

BOOTPROTO=static TYPE=eth CONFIG_WIRELESS=no
SYSTEMD_BOOTPROTO=static CONFIG_IPV4=yes DISABLED=no NM_CONTROLLED=no SYSTEMD_CONTROLLED=no

echo "192.168.1.62/26" > /etc/net/ifaces/ens18/ipv4address echo "default via 192.168.1.1" > /etc/net/ifaces/ens18/ipv4route echo nameserver 8.8.8.8 > /etc/resolv.conf
systemctl restart network #ip -c -br a
#ip route show
#ip a show

Настройка статического IP адреса на BR-SRV root / toor
hostnamectl hostname br-srv.au-team.irpo; exec bash

[root@noname ~]# cd /etc/net/ifaces/ [root@noname ifaces]# cd ens18 [root@noname ens18]# vim options

BOOTPROTO=static TYPE=eth CONFIG_WIRELESS=no
SYSTEMD_BOOTPROTO=static CONFIG_IPV4=yes DISABLED=no NM_CONTROLLED=no SYSTEMD_CONTROLLED=no
 
echo "192.168.0.30/27" > /etc/net/ifaces/ens18/ipv4address echo "default via 192.168.0.1" > /etc/net/ifaces/ens18/ipv4route echo nameserver 8.8.8.8 > /etc/resolv.conf
systemctl restart network #ip -c -br a
#ip route show	- шлюз
#ip a show

Настройка сетевой инфраструктуры


Рисунок 1
 
1. Произведите базовую настройку устройств:
Таблица 1 – IP планирование
Имя
устройства	IPv4 адрес	Шлюз по умолчанию
ISP	10.0.55.15 / 24	-
	172.16.4.1 / 28	-
	172.16.5.1 / 28	-
HQ-RTR	172.16.4.14 / 28	-
	192.168.1.1 / 26	-
	192.168.1.65 / 28	-
	192.168.1.81 / 29	-
	172.16.0.1 / 30	-
HQ-SRV	192.168.1.62 / 26	192.168.1.1
HQ-CLI	DHCP	192.168.1.65
BR-RTR	172.16.5.14 / 28	-
	192.168.0.1 / 27	-
	172.16.0.2 / 30	-
BR-SVR	192.168.0.30 / 27	192.168.0.1

Таблица 2 – Таблица доменных имен
Устройство	Запись	Тип
HQ-RTR	hq-rtr.au-team.irpo	A,PTR
BR-RTR	br-rtr.au-team.irpo	A
HQ-SRV	hq-srv.au-team.irpo	A,PTR
HQ-CLI	hq-cli.au-team.irpo	A,PTR
BR-SRV	br-srv.au-team.irpo	A
HQ-RTR	moodle.au-team.irpo	CNAME
HQ-RTR	wiki.au-team.irpo	CNAME
 Настройте имена устройств согласно топологии. Используйте полное доменное имя;
Выполняем	вход	из	под	пользователя	по	умолчанию	(admin/admin):

HQ-RTR:
(config)#hostname HQ-RTR 
(config)#ip domain-name au-team.irpo

BR-RTR:
(config)#hostname BR-RTR 
(config)#ip domain-name au-team.irpo
#show hostname
 
Настроим интерфейс на HQ-RTR, который смотрит в сторону ISP, HQ-SRV, HQ-CLI и Management:
(config)#interface int0
(config-if)#description "to isp" 
(config-if)#ip address 172.16.4.14/28
(config)#port te0
(config-port)#service-instance te0/int0
(config- service-instance)#encapsulation untagged
(config)#interface int0
(config-if)#connect port te0 service-instance te0/int0

(config)#interface int1
(config-if)#description "to hq-srv" 
(config-if)#ip address 192.168.1.1/26 
(config)#port te1
(config-port)#service-instance te1/int1
(config- service-instance)#encapsulation dot1q 100 exact 
(config- service-instance)#rewrite pop 1
(config)#interface int1
(config-if)#connect port te1 service-instance te1/int1

(config)#interface int2
(config-if)#description "to hq-cli"
(config-if)#ip address 192.168.1.65/28 
(config)#port te1
(config- port)#service-instance te1/int2
(config- service-instance)#encapsulation dot1q 200 exact 
(config- service-instance)#rewrite pop 1 (config)#interface int2
(config-if)#connect port te1 service-instance te1/int2

(config)#interface int3
(config-if)#description "to management" (config-if)#ip address 192.168.1.81/29
(config)#port te1
(config- port)#service-instance te1/int3
(config- service-instance)#encapsulation dot1q 999 exact
(config- service-instance)#rewrite pop 1
(config)#interface int3
(config-if)#connect port te1 service-instance te1/int3

HQ-RTR(config)#ip route 0.0.0.0/0 172.16.4.1
 
Проверка: #show port #show port brief #show interface
#show service-instance brief #show ip interface br
#ping 8.8.8.8
Настроим BR-RTR:
#interface int0 #description "to isp"
#ip address 172.16.5.14/28
#interface int1 #description "to br-srv" 
#ip address 192.168.0.1/27
#port te0
#service-instance te0/int0
#encapsulation untagged
#port te1
#service-instance te1/int1 
#encapsulation untagged
#interface int0
#connect port te0 service-instance te0/int0 
#interface int1
#connect port te1 service-instance te1/int1 
#ip route 0.0.0.0/0 172.16.5.1

3. Создание локальных учетных записей на HQ и BR:
#username net_admin 
#password P@$$word
#role admin

#show users localdb
6.	Между офисами HQ и BR необходимо сконфигурировать IP-туннель HQ-RTR(config)#int tunnel.0
(config-if-tunnel)#ip address 172.16.0.1/30 
(config-if-tunnel)# ip mtu 1400
(config-if-tunnel)#ip tunnel 172.16.4.14 172.16.5.14 mode gre
Создаем интерфейс GRE-туннеля на BR-RTR:
#int tunnel.0
#ip address 172.16.0.2/30 #ip mtu 1400
#ip tunnel 172.16.5.14 172.16.4.14 mode gre
 
Проверка:
HQ-RTR#ping 172.16.5.14
7.	Обеспечьте динамическую маршрутизацию: ресурсы одного офиса должны быть доступны из другого офиса. Для обеспечения динамической маршрутизации используйте link state протокол на ваше усмотрение
HQ-RTR(config)#router ospf 1
(config-router)#router-id 1.1.1.1
(config-router)#network 172.16.0.0/30 area 0
(config-router)#network 192.168.1.0/26 area 0 
(config-router)#network 192.168.1.64/28 area 0 
(config-router)#network 192.168.1.80/29 area 0 
(config-router)#passive-interface default 
(config-router)#no passive-interface tunnel.0
HQ-RTR(config)#interface tunnel.0
(config-if-tunnel)#ip ospf authentication message-digest 
(config-if-tunnel)#ip ospf message-digest-key 1 md5 P@ssw0rd

BR-RTR#router ospf 1
#router-id 2.2.2.2
#network 172.16.0.0/30 area 0 
#network 192.168.0.0/27 area 0 
#passive-interface default
#no passive-interface tunnel.0 
BR-RTR(config)#interface tunnel.0
(config-if-tunnel)#ip ospf authentication message-digest
(config-if-tunnel)#ip ospf message-digest-key 1 md5 P@ssw0rd
Проверка:
#show ip route
HQ-RTR#ping 192.168.0.1
8.	Настройка динамической трансляции адресов Указываем внутренние и внешние интерфейсы:
HQ-RTR(config)#int int1 
(config-if)#ip nat inside
(config)#int int2
(config-if)#ip nat inside
(config)#int int3
(config-if)#ip nat inside
(config)#int int0
(config-if)#ip nat outside
(config)#ip nat pool NAT_POOL 192.168.1.1-192.168.1.62,192.168.1.65-192.168.1.78,192.168.1.81-192.168.1.87
 
(config)#ip	nat	source	dynamic	inside-to-outside	pool NAT_POOL overload interface int0
Настройка NAT на BR-RTR
BR-RTR(config)#int int1 #ip nat inside
#int int0
#ip nat outside
#ip nat pool NAT_POOL 192.168.0.1-192.168.0.30
#ip nat source dynamic inside-to-outside pool NAT_POOL overload interface int0
Проверка доступ к Internet:
#ping 77.88.8.8
#ping 8.8.8.8
9.	Настройка протокола динамической конфигурации хостов
Для офиса HQ в качестве сервера DHCP выступает маршрутизатор HQ-RTR.

(config)#ip pool cli_pool 1
(config-ip-pool)#range 192.168.1.66-192.168.1.78
(config)#dhcp-server 1
(config-dhcp-server)#pool cli_pool 1
(config-dhcp-server)#mask 255.255.255.240
(config-dhcp-server)#gateway 192.168.1.65
(config-dhcp-server)#dns 192.168.1.62
(config-dhcp-server)#domain-name au-team.irpo 
(config)#interface int2
(config-if)#dhcp-server 1
Проверка:
HQ-CLI – user / resu
HQ-CLI получил IP адрес.
HQ-CLI#ping 8.8.8.8
HQ-CLI#ping 192.168.0.1
МОДУЛЬ 2 
hq-rtr(config)#ntp server 172.16.4.1
hq-rtr(config)#write memory
Building configuration...

.

br-rtr(config)#ntp server 172.16.5.1
br-rtr(config)#write memory
Building configuration...

.

hq-rtr(config)#security none 
hq-rtr(config)#write memory
Building configuration...

.

br-rtr(config)#security none
br-rtr(config)#write memory
Building configuration...

.

br-rtr>enable
br-rtr#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
br-rtr(config)#ip nat source static tcp 192.168.0.30 8080 172.16.5.14 80
br-rtr(config)#ip nat source static tcp 192.168.0.30 2024 172.16.5.14 2024
br-rtr(config)#write memory
Building configuration...

.

hq-rtr>enable
hq-rtr#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
hq-rtr(config)#ip nat source static tcp 192.168.1.62 2024 172.16.4.14 2024
hq-rtr(config)#write memory
Building configuration...

СКРИНЫ: сами, айпи, dhcp, gre, ospf, nat, ntp
